## Basic Check

In [15]:
import pandas as pd
df = pd.read_parquet("us_population_2003_2015_filtered.parquet")
df.sample(10)

          year state_fips  county_fips  race  hispanic  sex  age  population
2322277   2004         SD        46035   NaN       NaN    1  914          13
12103114  2012         AR         5097   NaN       NaN    3  920           0
14163949  2013         NJ        34033   NaN       NaN    1  923    40000032
9980936   2010         MS        28161   NaN       NaN    2  926    10000002
10082028  2010         NH        33017   NaN       NaN    2  926    30000000
3524200   2005         OH        39107   NaN       NaN    3  920    10000000
16986745  2015         NM        35006   NaN       NaN    2  923    50000000
6682300   2008         AL         1055   NaN       NaN    3  923           0
9189880   2009         UT        49011   NaN       NaN    2  922    60000001
5561838   2007         GA        13255   NaN       NaN    2  923          15

In [7]:
df.shape

(17620800, 8)

In [ ]:
# Year Coverage Check
df['year'].value_counts().sort_index()

year
2003    1316746
2004    1323151
2005    1337165
2006    1344697
2007    1346970
2008    1339344
2009    1337394
2010    1339611
2011    1344461
2012    1359001
2013    1391013
2014    1391951
2015    1449296
Name: count, dtype: int64

In [ ]:
# Missing Values Check
# race and hipanic should be missing
df.isna().sum()
df.isna().mean()

year           0.0
state_fips     0.0
county_fips    0.0
race           1.0
hispanic       1.0
sex            0.0
age            0.0
population     0.0
dtype: float64

In [11]:
# No negative/extreme population
df[df['population'] < 0]
df[df['population'] > 1e9]

Empty DataFrame
Columns: [year, state_fips, county_fips, race, hispanic, sex, age, population]
Index: []

In [ ]:
# Age Check
df['age'].unique()[:20]

array([910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922,
       923, 924, 925, 926, 927, 928, 929])